## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:22" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:22" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 22 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-graphql must be replaced
+/- resource "aws_s3_object" "lambda_artifact-graphql" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "2993644c1acbb7ff960f2832fb4d24b7-6" -> "c6fcf8c8c1afe27b80e4cd51c54b9fd9"
      ~ id                     = "graphql.019f0f75d72e94db053519266663fe59.zip" -> (known after apply)
      ~ key                    = "graphql.019f0f75d72e94db053519266663fe59.zip" -> "graphql.c6fcf8c8c1afe27b80e4cd51c54b9fd9.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "019f0f75d72e94db053519266663fe59" -> "c6fcf8c8c1afe27b80e4cd51c54b9fd9"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "thd5ptmbgkQoC7HJN0Go_IZJb2EVciYt" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "088397a06c7f21d6d0d2c03a83fdd0b2" -> "0c38d5829b89f35e41c9c1f5fbc346cd"
        id                     = "dist/200.html"
      ~ source_hash            = "088397a06c7f21d6d0d2c03a83fdd0b2" -> "0c38d5829b89f35e41c9c1f5fbc346cd"
        tags                   = {}
      ~ version_id             = "Jy_r_anI1ICxwaVTVJnuNd.2PbnOOriX" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "d35017282fc285bb7f08a3b3251be5c6" -> "37cee5945293663c1502d14455a2e7bf"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "d35017282fc285bb7f08a3b3251be5c6" -> "37cee5945293663c1502d14455a2e7bf"
        tags                   = {}
      ~ version_id             = "TMyHVf_XNAEmQtk4LSNnOUS2kSWy4iwY" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "c2f524614405252d6126d4bcb5569546" -> "b391aba838ecf1d4febf80fb9240fba5"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "c2f524614405252d6126d4bcb5569546" -> "b391aba838ecf1d4febf80fb9240fba5"
        tags                   = {}
      ~ version_id             = "MJd20MxCtyH2Seb9FpNRFpr154hz4DcT" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "088397a06c7f21d6d0d2c03a83fdd0b2" -> "0c38d5829b89f35e41c9c1f5fbc346cd"
        id                     = "dist/index.html"
      ~ source_hash            = "088397a06c7f21d6d0d2c03a83fdd0b2" -> "0c38d5829b89f35e41c9c1f5fbc346cd"
        tags                   = {}
      ~ version_id             = "XLrFo853vLSJyW2QsIguXrn6Tno3khjR" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/1.2bd6f191.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "c53f8af00d1bf863d53ebdd383555705"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/1.2bd6f191.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/1.2bd6f191.chunk.js"
+       source_hash            = "c53f8af00d1bf863d53ebdd383555705"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/1.2bd6f191.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "fff832de01eb9de482aea2f882eb271d"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/1.2bd6f191.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/1.2bd6f191.chunk.js.LICENSE.txt"
+       source_hash            = "fff832de01eb9de482aea2f882eb271d"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/102.0bf0999c.chunk.js"] will be destroyed
  # (because key ["static/js/102.0bf0999c.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "b5f2fd291c3fd94a76cc0fb728f850bc" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/102.0bf0999c.chunk.js" -> null
-       key                    = "dist/static/js/102.0bf0999c.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/102.0bf0999c.chunk.js" -> null
-       source_hash            = "b5f2fd291c3fd94a76cc0fb728f850bc" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "m83p9uuC9f76AamH9_Svzc0_g4VUSVh2" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/102.0bf0999c.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/102.0bf0999c.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "c3df7dbb55556fb3f85b6bf3feb01a68" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/102.0bf0999c.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/102.0bf0999c.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/102.0bf0999c.chunk.js.LICENSE.txt" -> null
-       source_hash            = "c3df7dbb55556fb3f85b6bf3feb01a68" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "yQ3hHq6JPTopsPeL3MOdiOvGGTS.wwAC" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/233.d266196c.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "60a9aa452ef98b7962c3c504bbbe1734"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/233.d266196c.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/233.d266196c.chunk.js"
+       source_hash            = "60a9aa452ef98b7962c3c504bbbe1734"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/233.d266196c.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "b0b9d6c66b18ac480194b45244c2082e"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/233.d266196c.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/233.d266196c.chunk.js.LICENSE.txt"
+       source_hash            = "b0b9d6c66b18ac480194b45244c2082e"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/390.ded542e6.chunk.js"] will be destroyed
  # (because key ["static/js/390.ded542e6.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "3d4480161f854ec00119305994b2a875" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/390.ded542e6.chunk.js" -> null
-       key                    = "dist/static/js/390.ded542e6.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/390.ded542e6.chunk.js" -> null
-       source_hash            = "3d4480161f854ec00119305994b2a875" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "us0.nXCzw_q0k47mjTw.zd84QTGru3e2" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/390.ded542e6.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/390.ded542e6.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "77a14a8b920919edc64ec57fe4c9419a" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/390.ded542e6.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/390.ded542e6.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/390.ded542e6.chunk.js.LICENSE.txt" -> null
-       source_hash            = "77a14a8b920919edc64ec57fe4c9419a" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "yQYSUqhenYuWzkPFZIVGXCFY3VBxTS.R" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/504.d1f9a630.chunk.js"] will be destroyed
  # (because key ["static/js/504.d1f9a630.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "cb5744ee815de61b61ef4e31bd49a77a" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/504.d1f9a630.chunk.js" -> null
-       key                    = "dist/static/js/504.d1f9a630.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/504.d1f9a630.chunk.js" -> null
-       source_hash            = "cb5744ee815de61b61ef4e31bd49a77a" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "74GyNcQoVjV0H49UXp3Y2IUiTMhIWbNg" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/504.d1f9a630.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/504.d1f9a630.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "db6b18301fc763e7ad4cf43d579a2390" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/504.d1f9a630.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/504.d1f9a630.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/504.d1f9a630.chunk.js.LICENSE.txt" -> null
-       source_hash            = "db6b18301fc763e7ad4cf43d579a2390" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "Gf5h3..uCaJtZP9_.JZKeifbQqVw5z3W" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/57.bc58867e.chunk.js"] will be destroyed
  # (because key ["static/js/57.bc58867e.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "d920bd51c27cdaa42482d2196bcf620c" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/57.bc58867e.chunk.js" -> null
-       key                    = "dist/static/js/57.bc58867e.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/57.bc58867e.chunk.js" -> null
-       source_hash            = "d920bd51c27cdaa42482d2196bcf620c" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "twtcImJ4xjFezel0TRkUtqfakKfJ50w7" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/57.bc58867e.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/57.bc58867e.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "406ecf0d41f22ef13cd249dc3bd0e9cd" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/57.bc58867e.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/57.bc58867e.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/57.bc58867e.chunk.js.LICENSE.txt" -> null
-       source_hash            = "406ecf0d41f22ef13cd249dc3bd0e9cd" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "sz0uVbqnZsvmpQdP0nMHrun1BDWuCH2j" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/698.6a9b478e.chunk.js"] will be destroyed
  # (because key ["static/js/698.6a9b478e.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "c5ef8a6cf973572f314f43057ee341d9" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/698.6a9b478e.chunk.js" -> null
-       key                    = "dist/static/js/698.6a9b478e.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/698.6a9b478e.chunk.js" -> null
-       source_hash            = "c5ef8a6cf973572f314f43057ee341d9" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "P1kQVLJS2Nj70JkDGyUeCLcZg5AYMp4g" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/698.6a9b478e.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/698.6a9b478e.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "bf9792ae355d2f37b41761716326133b" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/698.6a9b478e.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/698.6a9b478e.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/698.6a9b478e.chunk.js.LICENSE.txt" -> null
-       source_hash            = "bf9792ae355d2f37b41761716326133b" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "NppfOfePNEMgrm4VorFHfB_1FeMb6Ziy" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/766.425b18b0.chunk.js"] will be destroyed
  # (because key ["static/js/766.425b18b0.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "fbd0fd5f8254ec9637adfebd084ffbac" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/766.425b18b0.chunk.js" -> null
-       key                    = "dist/static/js/766.425b18b0.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/766.425b18b0.chunk.js" -> null
-       source_hash            = "fbd0fd5f8254ec9637adfebd084ffbac" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "rybwOzKfIuvaoUXS_4cN7K8FQifDIB7t" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/766.425b18b0.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/766.425b18b0.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "db6b18301fc763e7ad4cf43d579a2390" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/766.425b18b0.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/766.425b18b0.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/766.425b18b0.chunk.js.LICENSE.txt" -> null
-       source_hash            = "db6b18301fc763e7ad4cf43d579a2390" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "sI.cuXd4k08B57kR9UvyL8k7R9aXtPvm" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/92.7e8b9d86.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "8c90f0e9558dc77fb3a4edb30caba24c"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/92.7e8b9d86.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/92.7e8b9d86.chunk.js"
+       source_hash            = "8c90f0e9558dc77fb3a4edb30caba24c"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/92.7e8b9d86.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "a5497d27dac53990a3547d60edfc26ae"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/92.7e8b9d86.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/92.7e8b9d86.chunk.js.LICENSE.txt"
+       source_hash            = "a5497d27dac53990a3547d60edfc26ae"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyAgencyPage.0e32d0ae.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "d69f8e062d9db1349c6e5e81351475e8"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/AgencyAgencyPage.0e32d0ae.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyAgencyPage.0e32d0ae.chunk.js"
+       source_hash            = "d69f8e062d9db1349c6e5e81351475e8"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyAgencyPage.0e32d0ae.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "a912b20cd9d4d7a1a23cfb2936fb2037"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/AgencyAgencyPage.0e32d0ae.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyAgencyPage.0e32d0ae.chunk.js.LICENSE.txt"
+       source_hash            = "a912b20cd9d4d7a1a23cfb2936fb2037"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyAgencyPage.d7739b59.chunk.js"] will be destroyed
  # (because key ["static/js/AgencyAgencyPage.d7739b59.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "4af2c4de49a53e95ad9977445a721798" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/AgencyAgencyPage.d7739b59.chunk.js" -> null
-       key                    = "dist/static/js/AgencyAgencyPage.d7739b59.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyAgencyPage.d7739b59.chunk.js" -> null
-       source_hash            = "4af2c4de49a53e95ad9977445a721798" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "PJwCN9gWQ6R02A3qxHvBCmdYo6DlSood" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyAgencyPage.d7739b59.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/AgencyAgencyPage.d7739b59.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "69f3d6de34528788bed3546f0c15f806" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/AgencyAgencyPage.d7739b59.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/AgencyAgencyPage.d7739b59.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyAgencyPage.d7739b59.chunk.js.LICENSE.txt" -> null
-       source_hash            = "69f3d6de34528788bed3546f0c15f806" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "o9X6KrnVP5KJKfPkrUnE4xN1WljBRxhT" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyEditAgencyPage.623680c4.chunk.js"] will be destroyed
  # (because key ["static/js/AgencyEditAgencyPage.623680c4.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "b33ac1bf57b0e8da08724a0f31932537" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/AgencyEditAgencyPage.623680c4.chunk.js" -> null
-       key                    = "dist/static/js/AgencyEditAgencyPage.623680c4.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyEditAgencyPage.623680c4.chunk.js" -> null
-       source_hash            = "b33ac1bf57b0e8da08724a0f31932537" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "5qQM48r5Kbc6QT8CZs.yLxs.isJrljYO" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyEditAgencyPage.623680c4.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/AgencyEditAgencyPage.623680c4.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "9d6c41dcd3725d331b1cedb6e9077c9c" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/AgencyEditAgencyPage.623680c4.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/AgencyEditAgencyPage.623680c4.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyEditAgencyPage.623680c4.chunk.js.LICENSE.txt" -> null
-       source_hash            = "9d6c41dcd3725d331b1cedb6e9077c9c" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "URaabMMUWpmVn4Z6qAO_ML2h2GqqfTSV" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyEditAgencyPage.fd3dd3de.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "cbe411fdc09e6d95c5fd23882ba788d6"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/AgencyEditAgencyPage.fd3dd3de.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyEditAgencyPage.fd3dd3de.chunk.js"
+       source_hash            = "cbe411fdc09e6d95c5fd23882ba788d6"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyEditAgencyPage.fd3dd3de.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "1e0c57567747bddd0ca98c61ae7be577"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/AgencyEditAgencyPage.fd3dd3de.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyEditAgencyPage.fd3dd3de.chunk.js.LICENSE.txt"
+       source_hash            = "1e0c57567747bddd0ca98c61ae7be577"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyNewAgencyPage.5add27d4.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "89fc1842690bbeb4b39eb788d68273c0"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/AgencyNewAgencyPage.5add27d4.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyNewAgencyPage.5add27d4.chunk.js"
+       source_hash            = "89fc1842690bbeb4b39eb788d68273c0"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyNewAgencyPage.5add27d4.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "bff59781626ae53e91d0da1b84ebe35e"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/AgencyNewAgencyPage.5add27d4.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyNewAgencyPage.5add27d4.chunk.js.LICENSE.txt"
+       source_hash            = "bff59781626ae53e91d0da1b84ebe35e"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyNewAgencyPage.94015f7b.chunk.js"] will be destroyed
  # (because key ["static/js/AgencyNewAgencyPage.94015f7b.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "5a387b2cc0f1edc97a8687365f3d9bbf" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/AgencyNewAgencyPage.94015f7b.chunk.js" -> null
-       key                    = "dist/static/js/AgencyNewAgencyPage.94015f7b.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyNewAgencyPage.94015f7b.chunk.js" -> null
-       source_hash            = "5a387b2cc0f1edc97a8687365f3d9bbf" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "4B.c5ucCDH7cq9ZZozbAg.tgwh58njKZ" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyNewAgencyPage.94015f7b.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/AgencyNewAgencyPage.94015f7b.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "ee89b86c60a8b8dfd78f65ffcb84e1bb" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/AgencyNewAgencyPage.94015f7b.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/AgencyNewAgencyPage.94015f7b.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyNewAgencyPage.94015f7b.chunk.js.LICENSE.txt" -> null
-       source_hash            = "ee89b86c60a8b8dfd78f65ffcb84e1bb" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "rc5KXniipIFLlxqwycT9V8EPu884rW4r" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationEditOrganizationPage.46c7d494.chunk.js"] will be destroyed
  # (because key ["static/js/OrganizationEditOrganizationPage.46c7d494.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "89c4abff3cac240062305f1cfd66978a" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/OrganizationEditOrganizationPage.46c7d494.chunk.js" -> null
-       key                    = "dist/static/js/OrganizationEditOrganizationPage.46c7d494.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationEditOrganizationPage.46c7d494.chunk.js" -> null
-       source_hash            = "89c4abff3cac240062305f1cfd66978a" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "D6hm.LmapmGSoDEzmBJcQ4QeN1G2_k7d" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationEditOrganizationPage.46c7d494.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/OrganizationEditOrganizationPage.46c7d494.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "69355ecb6007be9171e34be838b9f365" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/OrganizationEditOrganizationPage.46c7d494.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/OrganizationEditOrganizationPage.46c7d494.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationEditOrganizationPage.46c7d494.chunk.js.LICENSE.txt" -> null
-       source_hash            = "69355ecb6007be9171e34be838b9f365" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "03QoUYtPpFrrDWVkn2EDiYjdVG7xIt9q" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationEditOrganizationPage.ebcd145a.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "06704eeb39b71daf9467b718e7e4f076"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/OrganizationEditOrganizationPage.ebcd145a.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationEditOrganizationPage.ebcd145a.chunk.js"
+       source_hash            = "06704eeb39b71daf9467b718e7e4f076"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationEditOrganizationPage.ebcd145a.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "89bec65d8ddbf829fc049240d15672b4"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/OrganizationEditOrganizationPage.ebcd145a.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationEditOrganizationPage.ebcd145a.chunk.js.LICENSE.txt"
+       source_hash            = "89bec65d8ddbf829fc049240d15672b4"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationNewOrganizationPage.053edd4c.chunk.js"] will be destroyed
  # (because key ["static/js/OrganizationNewOrganizationPage.053edd4c.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "3fdc1ca4fd3b0d97e275d08bb1a72120" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/OrganizationNewOrganizationPage.053edd4c.chunk.js" -> null
-       key                    = "dist/static/js/OrganizationNewOrganizationPage.053edd4c.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationNewOrganizationPage.053edd4c.chunk.js" -> null
-       source_hash            = "3fdc1ca4fd3b0d97e275d08bb1a72120" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "ooBgRAnYjXTi2ZCTcRREdeu.aJg7u4Pc" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationNewOrganizationPage.053edd4c.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/OrganizationNewOrganizationPage.053edd4c.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "84927c4f9ab883e77b0100ca8b559926" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/OrganizationNewOrganizationPage.053edd4c.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/OrganizationNewOrganizationPage.053edd4c.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationNewOrganizationPage.053edd4c.chunk.js.LICENSE.txt" -> null
-       source_hash            = "84927c4f9ab883e77b0100ca8b559926" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "Ct1jBOTx71e.hzBPZSYTnshAe4iKER_l" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationNewOrganizationPage.8711f6e5.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "5aede0957941092de9aff46b97976b47"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/OrganizationNewOrganizationPage.8711f6e5.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationNewOrganizationPage.8711f6e5.chunk.js"
+       source_hash            = "5aede0957941092de9aff46b97976b47"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationNewOrganizationPage.8711f6e5.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "30a505666a7dadc1be936949bdb251f4"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/OrganizationNewOrganizationPage.8711f6e5.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationNewOrganizationPage.8711f6e5.chunk.js.LICENSE.txt"
+       source_hash            = "30a505666a7dadc1be936949bdb251f4"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationOrganizationPage.4fda6393.chunk.js"] will be destroyed
  # (because key ["static/js/OrganizationOrganizationPage.4fda6393.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "514ee6003387a3d1aa23afa2c73248e5" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/OrganizationOrganizationPage.4fda6393.chunk.js" -> null
-       key                    = "dist/static/js/OrganizationOrganizationPage.4fda6393.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationOrganizationPage.4fda6393.chunk.js" -> null
-       source_hash            = "514ee6003387a3d1aa23afa2c73248e5" -> null...*[Comment body truncated]*